thekojac304/OpenU5-Native/native/targets/tdeck/sdkconfig.defaults
# LilyGO T-Deck Plus: ESP32-S3, 16 MiB QIO flash, 8 MiB OPI PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# The ESP32-S3FN16R8 fitted to T-Deck Plus is specified by LilyGO at 240 MHz.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
# Reach app_main and print a warning even if PSRAM cannot initialize.
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
# Keep all static data and executable code independent of external RAM.
# CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY is not set
# CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY is not set
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set

# Serial over the board's USB-C connector, without Arduino or TinyUSB.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Native game + FAT/SD/SPI + diagnostic formatting need a real call-stack budget.
# Large app/CRC/display buffers are off-stack; require >=4 KiB measured reserve.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
